Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/help_with_buying_a_home/home_choice_loan.html.txt.tmx
Source language: en
Languages: ga

source: Home Choice Loan is a mortgage for first-time buyers who cannot get a mortgage or sufficient finance from a bank or a building society
ga: Morgáiste í an Iasacht Rogha Tí do cheannaitheoirí chéad uaire nach féidir leo morgáiste nó maoiniú a ndóthain a fháil ó na bainc ná ó na cumainn foirgníochta

source: It provides access to credit for first-time buyers who can afford to purchase on the open market and can afford to repay a mortgage
ga: Tugann sí an chaoi do cheannaitheoirí chéad uaire arb acmhainn dóibh ceannach ar an margadh oscailte agus morgáiste a aisíoc teacht a bheith acu ar mhaoiniú

source: A Home Choice Loan is the same as a normal capital- and interest-bearing mortgage and is repaid on a monthly basis
ga: Mar a chéile an Iasacht Rogha Tí agus gnáthmhorgáiste caipitil agus úis a aisíoctar ar bhonn míosúil

source: Four designated local authorities provide Home Choice Loans on behalf of all local authorities
ga: Tugann 4 údarás áitiúil ainmnithe Iasachtaí Rogha Tí ar son na n-údarás áitiúil ar fad

source: Who can get a Home Choice Loan?
ga: Cé a fhéadfaidh Iasacht Rogha Tí a fháil?

source: To qualify for a Home Choice Loan you must:
ga: Lena bheith incháilithe d’Iasacht Rogha Tí caithfidh tú:

source: • Be a first-time buyer (some exceptions may apply, for example, if you are divorced)
ga: • A bheith ag ceannach den chéad uair (b’fhéidir go nglacfar le heisceachtaí áirithe, mar shampla, má tá tú idirscartha)

source: • Earn more than €35,000 as a single applicant or over €45,000 combined income as joint applicants
ga: • A bheith ag tuilleamh níos mó ná €35,000 in aghaidh na bliana mar iarrthóir aonair nó níos mó ná €45,000 más lánúin ata i gceist

source: • Be in continuous employment for at least 2 years (if self-employed you must be able to submit 2 years' certified accounts)
ga: • Post buan a bheith agat le dhá bhliain anuas (más duine féinfhostaithe tú ní mór duit cuntais dheimhnithe a chur faoi bhráid don dá bhliain)

source: • Have proof of being unsuccessful in securing a sufficient mortgage from 2 banks or building societies to buy a home
ga: • An cruthú a bheith agat nár éirigh leat morgáiste dóthanach a fháil ó 2 bhanc ná ó chumann foirgníochta le teach a cheannach

source: • Be aged between 18 and 70
ga: • A bheith idir 18 agus 70 bliain d'aois

source: What property can you buy?
ga: Cén sórt réadmhaoine is féidir a cheannach?

source: Home Choice Loan is available for the purchase of a new or second-hand property or to build your own home
ga: Tá an Iasacht Rogha Tí ar fáil chun réadmhaoin nua nó athláimhe a cheannach

source: The property must comply with building and planning regulations and must be:
ga: Caithfidh an réadmhaoin cloí sé leis na rialacháin foirgníochta agus pleanála

source: • Located in the Republic of Ireland
ga: • Suite i bPoblacht na hÉireann

source: • For sale on the open market
ga: • Ar díol ar an margadh oscailte

source: • A residential property that you will live in
ga: • Ina réadmhaoin chónaithe, ina mbeidh tú i do chónaí

source: • Covered by Home Bond, Premier Guarantee or equivalent (new properties only)
ga: • Cumhdaithe ag Banna Tí, Príomhráthaíocht nó a samhail

source: • No larger than 175 square metres
ga: • 175 méadar cearnaithe nó níos lú

source: Home Choice Loan will provide up to 92% of the market value of a property up to a maximum of €285,000
ga: Cuirfidh an Iasacht Rogha Tí chomh hard le 92% de luach margaidh na réadmhaoine ar fáil, chomh hard le €285,000 ar a mhéad

source: This means that you can borrow up to €285,000, depending on your income, up to a maximum of 92% of the value of the property purchased
ga: Féadfaidh tú chomh hard le €285,000 a thógáil ar iasacht, de réir an ioncaim atá agat, chomh hard le 92% de luach na réadmhaoine atá á ceannach ar a mhéad

source: Your mortgage term can be for a period up to 30 years
ga: Is féidir do théarma an mhorgáiste a bheith chomh fada le 30 bliain

source: A Home Choice Loan may not be increased in the future
ga: Ní fhéadfar an Iasacht Rogha Tí a mhéadú níos déanaí

source: However, you can refinance your Home Choice Loan by switching it to another bank or building society
ga: Ach féadfaidh tú an Iasacht Rogha Tí a athmhaoiniú ach í a aistriú chun bainc nó cumainn foirgníochta eile

source: Home Choice Loan has only one interest rate, which is variable variable – see the FAQs on the Home Choice Loan website for the current rate
ga: Aon ráta úis amháin atá ag an Iasacht Rogha Tí. Tá an ráta seo inathraitheach. Féach anseo ar homechoiceloan.ie

source: To apply for a Home Choice Loan you must first contact a Home Choice Loan authorised broker in your area to see if you are eligible for a Home Choice Loan
ga: Chun iarratas a dhéanamh ar Iasacht Rogha Tí, caithfear teagmháil a dhéanamh i dtús báire leis an bróicéir údaraithe le haghaidh Iasacht Rogha Tí i do cheantar féin chun fáil amach an bhfuil tú incháilithe don Iasacht Rogha Tí

source: If you are eligible and have a property you want to buy you should complete an application with your broker
ga: Má tá tú incháilithe agus réadmhaoin agat gur mian leat a cheannach, ba chóir duit iarratas a chomhlánú le do bhróicéir

source: Your broker will submit your application to a centralised Home Choice Loan assessment service
ga: Seolfaidh do bhróicéir an t-iarratas chuig lársheirbhís mheasúnaithe don Iasacht Rogha Tí

source: Your mortgage broker will be told of the decision
ga: Gheobhaidh do bhróicéir morgáiste scéal faoin gcinneadh

source: If you are successful, you will need to get an authorised valuer to assess the value of the property you want to buy
ga: Má éiríonn leis an iarratas, beidh gá luachálaí údaraithe a fháil chun measúnú a dhéanamh ar luach na réadmhaoine is mian leat a cheannach

source: You will also need to appoint a solicitor to undertake the legal conveyance work
ga: Beidh sé riachtanach duit aturnae a cheapadh chun obair sa dlí tíolactha a chomhlíonadh

source: Once the valuation is agreed, and all other requirements satisfied, a loan offer will be issued by one of the 4 designated local authorities
ga: Nuair atá an luacháil aontaithe, agus na riachtanais eile ar fad comhlíonta, eiseofar tairiscint iasachta trí cheann amháin de na 4 údarás áitiúil ainmnithe

source: Four designated local authorities operate the scheme on behalf of all other local authorities
ga: Feidhmíonn 4 údarás áitiúil ainmnithe an scéim ar son na n-údarás áitiúil ar fad

source: The 4 designated local authorities are:
ga: Is iad na 4 údarás áitiúil ainmnithe ná:

source: Contact a Home Choice Loan authorised broker in your area to see if you are eligible for a Home Choice Loan
ga: Déan teagmháil le bróicéir údaraithe le haghaidh Iasacht Rogha Tí i do cheantar féin chun fáil amach an bhfuil tú incháilithe don Iasacht Rogha Tí

source: More information is available from the Home Choice Loan website
ga: Tá tuilleadh eolais ar fáil ar láithreán gréasáin na hIasachta Rogha Tí
